#### Terraform Format and Style 🖌``
Environment: dev
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_partition.current: Reading...
data.aws_caller_identity.default: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_region.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-034f697d05267b01e]
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03450afa57a6288df]
module.eks_blueprints.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002]
data.aws_availability_zones.available: Read complete after 0s [id=ap-southeast-2]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/vpc-flow-log-to-cloudwatch-20221022101602450100000001]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_caller_identity.default: Read complete after 0s [id=158237136693]
data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::158237136693:user/service.infra-k8s.deployer]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=4025009984]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002-20221022101603510300000003]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ffab94f437dfb623]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cea5a00b2c07fe34]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b2923dedb8e64b3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06953b6631b897b53]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-096a58e583e0ac47c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00907bce6cbcc6b47]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-05000514d72d54e9c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0bbfe145c7abf377f]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-03450afa57a6288df]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-08d5a0fbd25a558cd]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-006e44e2327f6304e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-03e0c337a4a53b1c6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-088414014b168aae0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d639fd63ce2ba601]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ad8fb60c88cb7fe9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-039b53d79664f15ea]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06953b6631b897b531080289494]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0fe0c6935f00b0a3a]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-06fb9bbd7518f2d9f]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0025f0003669e533e]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=infra-k8s]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0746a4928e69fa71c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-028dca37fad47a0cd]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ebf8b4682b095f4e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01adb055e884040f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-029ed30db96eaa5fd]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0443c0238a54bcbe5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ef380c7e09deffa6]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0feb2e13632470598]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-039b53d79664f15ea1080289494]
data.aws_eks_addon_version.latest["vpc-cni"]: Reading...
data.aws_eks_addon_version.latest["kube-proxy"]: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Read complete after 0s [id=2633998141]
data.aws_eks_addon_version.latest["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Read complete after 0s [id=kube-proxy]
data.aws_eks_addon_version.latest["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Read complete after 0s [id=vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Read complete after 0s [id=coredns]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0adb46bdc2e9e48d0"
        id                   = "eipalloc-034f697d05267b01e"
      + network_interface    = "eni-0f8a2c7a0413b85e6"
      + private_dns          = "ip-10-0-4-38.ap-southeast-2.compute.internal"
      + private_ip           = "10.0.4.38"
        tags                 = {
            "Name" = "infra-k8s-ap-southeast-2a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-039b53d79664f15ea"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-01adb055e884040f2"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "infra-k8s-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-06953b6631b897b53"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-096a58e583e0ac47c"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "infra-k8s-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster_auth.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks_blueprints.data.aws_eks_cluster.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_blueprints.data.http.eks_cluster_readiness[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "eks_cluster_readiness" {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 600
      + url              = (known after apply)
    }

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/created-by" = "terraform-aws-eks-blueprints"
              + "app.kubernetes.io/managed-by" = "terraform-aws-eks-blueprints"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.time_sleep.dataplane will be created
  + resource "time_sleep" "dataplane" {
      + create_duration = "10s"
      + id              = (known after apply)
      + triggers        = {
          + "data_plane_wait_arn" = (known after apply)
          + "eks_cluster_id"      = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["DeployedBy"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "DeployedBy"
      + resource_id = (known after apply)
      + value       = "Terraform"
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "dev"
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubOrg"
      + resource_id = (known after apply)
      + value       = "ethanbayliss"
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubRepo"
      + resource_id = (known after apply)
      + value       = "infra-k8s"
    }

  # module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "django-for-impatient"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + version                   = "1.23"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-088414014b168aae0",
              + "subnet-0ad8fb60c88cb7fe9",
              + "subnet-0d639fd63ce2ba601",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
          + "Name"        = "django-for-impatient-eks-irsa"
        }
      + tags_all        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
          + "Name"        = "django-for-impatient-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "django-for-impatient-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "django-for-impatient-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "django-for-impatient-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "django-for-impatient-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
          + "Name"        = "django-for-impatient-cluster"
        }
      + tags_all               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
          + "Name"        = "django-for-impatient-cluster"
        }
      + vpc_id                 = "vpc-03450afa57a6288df"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "django-for-impatient-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "Name"                                       = "django-for-impatient-node"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "Name"                                       = "django-for-impatient-node"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
      + vpc_id                 = "vpc-03450afa57a6288df"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_eks_fargate_profile.eks_fargate will be created
  + resource "aws_eks_fargate_profile" "eks_fargate" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-088414014b168aae0",
          + "subnet-0ad8fb60c88cb7fe9",
          + "subnet-0d639fd63ce2ba601",
        ]
      + tags                   = (known after apply)
      + tags_all               = (known after apply)

      + selector {
          + namespace = "default"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_policy.cwlogs[0] will be created
  + resource "aws_iam_policy" "cwlogs" {
      + arn         = (known after apply)
      + description = "Allow fargate profiles to write logs to CloudWatch"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role.fargate[0] will be created
  + resource "aws_iam_role" "fargate" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "EKS Fargate IAM Role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.cwlogs[0] will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_eks_fargate_profile.eks_fargate will be created
  + resource "aws_eks_fargate_profile" "eks_fargate" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "kube-system"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-088414014b168aae0",
          + "subnet-0ad8fb60c88cb7fe9",
          + "subnet-0d639fd63ce2ba601",
        ]
      + tags                   = (known after apply)
      + tags_all               = (known after apply)

      + selector {
          + namespace = "kube-system"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_policy.cwlogs[0] will be created
  + resource "aws_iam_policy" "cwlogs" {
      + arn         = (known after apply)
      + description = "Allow fargate profiles to write logs to CloudWatch"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role.fargate[0] will be created
  + resource "aws_iam_role" "fargate" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "EKS Fargate IAM Role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.cwlogs[0] will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks_blueprints.module.kms[0].aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/django-for-impatient"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks_blueprints.module.kms[0].aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "django-for-impatient EKS cluster secret encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount" = "158237136693"
                              + "kms:ViaService"    = "eks.ap-southeast-2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::158237136693:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access for all principals in the account that are authorized"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:List*",
                          + "kms:Get*",
                          + "kms:Describe*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::158237136693:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow direct access to key metadata to the account"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::158237136693:user/service.infra-k8s.deployer"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access for Key Administrators"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::158237136693:role/django-for-impatient-cluster-role"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::158237136693:role/django-for-impatient-cluster-role"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow attachment of persistent resources"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all                           = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.modify_kube_dns[0] will be created
  + resource "null_resource" "modify_kube_dns" {
      + id = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.remove_default_coredns_deployment[0] will be created
  + resource "null_resource" "remove_default_coredns_deployment" {
      + id = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].time_sleep.this will be created
  + resource "time_sleep" "this" {
      + create_duration = "1m"
      + id              = (known after apply)
      + triggers        = {
          + "eks_cluster_id" = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name        = "kube-proxy"
      + addon_version     = "v1.23.8-eksbuild.2"
      + arn               = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + preserve          = true
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller will be created
  + resource "aws_iam_policy" "aws_load_balancer_controller" {
      + arn         = (known after apply)
      + description = "Allows lb controller to manage ALB and NLB"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ec2:CreateSecurityGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name               = "vpc-cni"
      + addon_version            = "v1.11.4-eksbuild.1"
      + arn                      = (known after apply)
      + cluster_name             = (known after apply)
      + created_at               = (known after apply)
      + id                       = (known after apply)
      + modified_at              = (known after apply)
      + preserve                 = true
      + resolve_conflicts        = "OVERWRITE"
      + service_account_role_arn = (known after apply)
      + tags                     = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all                 = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_config_map.aws_logging will be created
  + resource "kubernetes_config_map" "aws_logging" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-logging"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_namespace.aws_observability will be created
  + resource "kubernetes_namespace" "aws_observability" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aws-observability" = "enabled"
            }
          + name             = "aws-observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "coredns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "CoreDNS is a DNS server that chains plugins and provides Kubernetes DNS Services"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "coredns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://coredns.github.io/helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = [
          + <<-EOT
                image:
                  repository: 602401143452.dkr.ecr.ap-southeast-2.amazonaws.com/eks/coredns
                  tag: v1.8.7-eksbuild.2
                deployment:
                  name: coredns
                  annotations:
                    eks.amazonaws.com/compute-type: fargate
                service:
                  name: kube-dns
                  annotations:
                    eks.amazonaws.com/compute-type: fargate
                podAnnotations:
                  eks.amazonaws.com/compute-type: fargate
            EOT,
        ]
      + verify                     = false
      + version                    = "1.19.4"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}

      + set {
          + name  = "blueprints.connection"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "aws-load-balancer-controller Helm Chart for ingress resources"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.4.3"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}

      + set {
          + name  = "podDisruptionBudget.maxUnavailable"
          + value = "1"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller-sa"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-03450afa57a6288df"
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account aws-node."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.kubernetes_dashboard[0].module.helm_addon.helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "kubernetes-dashboard"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "Kubernetes Dashboard Helm Chart"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubernetes-dashboard"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/dashboard/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = []
      + verify                     = false
      + version                    = "5.7.0"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0] will be created
  + resource "helm_release" "addon" {
      + atomic                     = false
      + chart                      = "cluster-proportional-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "Cluster Proportional Autoscaler Helm Chart"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-proportional-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/cluster-proportional-autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                nameOverride: coredns
                
                config:
                  linear:
                    coresPerReplica: 256
                    nodesPerReplica: 16
                    min: 1
                    max: 100
                    preventSinglePointFailure: true
                    includeUnschedulableNodes: true
                
                options:
                  target: "deployment/coredns"
                
                podSecurityContext:
                  seccompProfile:
                    type: RuntimeDefault
                  supplementalGroups: [ 65534 ]
                  fsGroup: 65534
                
                tolerations:
                  - key: "CriticalAddonsOnly"
                    operator: "Exists"
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.0"
      + wait                       = true
      + wait_for_jobs              = false

      + postrender {}
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "AWS IAM Role for the Kubernetes service account aws-load-balancer-controller-sa."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0] will be created
  + resource "kubernetes_service_account_v1" "irsa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller-sa"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 55 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: ethanbayliss, Action: `pull_request`, Workflow: `Terraform Testing`*